public class Main
{
    public static void main(String[] args) {
        System.out.println(" ██████╗ ██╗ ███╗   ███╗ ██████╗  ██╗ ██████╗   ██████╗  █████╗  ███████╗ ████████╗");
        System.out.println("██╔════╝ ██║ ████╗ ████║ ██╔══██╗ ██║ ██╔══██╗ ██╔════╝ ██╔══██╗ ██╔════╝ ╚══██╔══╝");
        System.out.println("╚█████╗  ██║ ██╔████╔██║ ██████╦╝ ██║ ██████╔╝ ╚█████╗  ██║  ██║ █████╗      ██║   ");
        System.out.println(" ╚═══██╗ ██║ ██║╚██╔╝██║ ██╔══██╗ ██║ ██╔══██╗  ╚═══██╗ ██║  ██║ ██╔══╝      ██║   ");
        System.out.println("██████╔╝ ██║ ██║ ╚═╝ ██║ ██████╦╝ ██║ ██║  ██║ ██████╔╝ ╚█████╔╝ ██║         ██║   ");
        System.out.println("╚═════╝  ╚═╝ ╚═╝     ╚═╝ ╚═════╝  ╚═╝ ╚═╝  ╚═╝ ╚═════╝   ╚════╝  ╚═╝         ╚═╝   ");

        System.out.println("=================================== Задание 3.6 ===================================\n");

        System.out.print("Диапазон диаметра шарика: 19-29\nДиапазон веса шарика: 64-84\n");
        System.out.print("Норма диаметра шарика: 22-26\nНорма веса шарика: 71-77\n");

        int[][] mas = new int[120][2];

        for (int i = 0; i < 120; i++) {
            mas[i][0] = (int) Math.round(Math.random() * 10) + 19;
            mas[i][1] = (int) Math.round(Math.random() * 20) + 64;
        }

        for (int i = 0; i < 120; i++) {
            if (22 <= mas[i][0] && mas[i][0] <= 26) {
                if (71 <= mas[i][1] && mas[i][1] <= 77) {
                    System.out.println("Шарик №" + (i+1) + " Диаметр: " + mas[i][0] + " Вес: " + mas[i][1] + " Шарик соответствует стандартам");
                } else {
                    System.out.println("Шарик №" + (i+1) + " Диаметр: " + mas[i][0] + " Вес: " + mas[i][1] + " Шарик не соответствует стандартам, отклонение по весу");
                }
            } else {
                if (71 <= mas[i][1] && mas[i][1] <= 77) {
                    System.out.println("Шарик №" + (i+1) + " Диаметр: " + mas[i][0] + " Вес: " + mas[i][1] + " Шарик не соответствует стандартам, отклонение по диаметру");
                } else {
                    System.out.println("Шарик №" + (i+1) + " Диаметр: " + mas[i][0] + " Вес: " + mas[i][1] + " Шарик не соответствует стандартам, отклонение по диаметру и весу");
                }
            }
        }

        System.out.println("\n===================================================================================");
    }
}