public class Main
{
    public static void main(String[] args) {
        System.out.println(" ██████╗ ██╗ ███╗   ███╗ ██████╗  ██╗ ██████╗   ██████╗  █████╗  ███████╗ ████████╗");
        System.out.println("██╔════╝ ██║ ████╗ ████║ ██╔══██╗ ██║ ██╔══██╗ ██╔════╝ ██╔══██╗ ██╔════╝ ╚══██╔══╝");
        System.out.println("╚█████╗  ██║ ██╔████╔██║ ██████╦╝ ██║ ██████╔╝ ╚█████╗  ██║  ██║ █████╗      ██║   ");
        System.out.println(" ╚═══██╗ ██║ ██║╚██╔╝██║ ██╔══██╗ ██║ ██╔══██╗  ╚═══██╗ ██║  ██║ ██╔══╝      ██║   ");
        System.out.println("██████╔╝ ██║ ██║ ╚═╝ ██║ ██████╦╝ ██║ ██║  ██║ ██████╔╝ ╚█████╔╝ ██║         ██║   ");
        System.out.println("╚═════╝  ╚═╝ ╚═╝     ╚═╝ ╚═════╝  ╚═╝ ╚═╝  ╚═╝ ╚═════╝   ╚════╝  ╚═╝         ╚═╝   ");

        System.out.println("=================================== Задание 3.7 ===================================\n");

        int[] mas = new int[25];
        int[] mas1 = new int[25];
        int max = 0, num = 0;

        for (int i = 0; i < 25; i++) {
            mas[i] = (int) Math.round(Math.random() * 899) + 100;
            System.out.print(mas[i] + " ");
        }

        for (int i = 0; i < 25; i++) {
            mas1[i] = mas[i] % 10 + (mas[i] / 10) % 10 + (mas[i] / 100) % 10;
            if (max < mas1[i]) {
                max = mas1[i];
                num = i;
            }
        }

        System.out.println("\nЧисло №" + (num+1) + " (" + mas[num] + ") имеет самую большую сумму цифр: " + max);

        System.out.println("\n===================================================================================");
    }
}